/**
用户管理
 */
CREATE TABLE  IF NOT EXISTS  t_user(
    `id`        BIGINT NOT NULL AUTO_INCREMENT  COMMENT '用户ID' ,
    `account`   VARCHAR(32)    COMMENT '账号' ,
    `password`  VARCHAR(64)    COMMENT '密码' ,
    `name`      VARCHAR(32)    COMMENT '用户名' ,
    `org_name`  VARCHAR(32)    COMMENT '机构名' ,
    `org_code`  VARCHAR(32)    COMMENT '机构代码' ,
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='机构管理';
TRUNCATE t_user;
INSERT INTO `t_user`(`id`, `account`, `password`, `name`, `org_name`, `org_code`) VALUES
    (1, '13147337616', '123456', '张飞', '行政部', '201001001'),
    (2, '13147217616', '123456', '吕布', '财务部', '201001002'),
    (3, '13147227616', '123456', '赵云', '商务部', '201001003'),
    (4, '13147237616', '123456', '诸葛亮', '市场部', '201002001'),
    (5, '13147244616', '123456', '小乔', '研发部', '201002002'),
    (6, '13147197116', '123456', '貂蝉', '技术部', '201002003'),
    (7, '13147192616', '123456', '司马懿', '市场部', '201003001'),
    (8, '13147193616', '123456', '关羽', '研发部', '201003003'),
    (9, '13147192616', '123456', '刘备', '技术部', '201003003'),
    (10, '1314715761', '123456', '孙尚香', '市场部', '201004001'),
    (11, '1314733761', '123456', '黄盖', '研发部', '201004003'),
    (12, '1314712616', '123456', '曹操', '技术部', '201004003'),
    (13, '1311913616', '123456', '孙权', '技术部', '201004003'),
    (14, '1314197616', '123456', '马超', '研发部', '201004003'),
    (15, '1314719761', '123456', '曹植', '研发部', '201004003');




