/**
机构管理
 */
CREATE TABLE  IF NOT EXISTS  `t_org` (
    `code`        VARCHAR(32)    NOT NULL   COMMENT '机构编码 代码生成' ,
    `name`        VARCHAR(32)    COMMENT '机构名称' ,
    `parent_code` VARCHAR(32)    COMMENT '父机构编码 顶级机构父机构代码为空' ,
    `parent_name` VARCHAR(32)    COMMENT '父机构名称' ,
    `sons` INT    COMMENT '子机构的数量 用于生成机构代码' ,
    PRIMARY KEY (`code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='机构管理';
TRUNCATE t_org;
INSERT INTO `t_org`(`code`, `name`, `parent_code`, `parent_name`, `sons`) VALUES
    ('201', '总公司', '0', '', 4),
    ('201001', '北京分公司', '201', '总公司', 3),
    ('201002', '上海分公司', '201', '总公司', 3),
    ('201003', '广州分公司', '201', '总公司', 3),
    ('201004', '武汉分公司', '201', '总公司', 3),
    ('201001001', '财务部', '201001', '北京分公司', 0),
    ('201001002', '商务部', '201001', '北京分公司', 0),
    ('201001003', '行政部', '201001', '北京分公司', 0),
    ('201002001', '市场部', '201002', '上海分公司', 0),
    ('201002002', '研发部', '201002', '上海分公司', 0),
    ('201002003', '技术部', '201002', '上海分公司', 0),
    ('201003001', '市场部', '201003', '广州分公司', 0),
    ('201003002', '研发部', '201003', '广州分公司', 0),
    ('201003003', '技术部', '201003', '广州分公司', 0),
    ('201004001', '市场部', '201004', '武汉分公司', 0),
    ('201004002', '研发部', '201004', '武汉分公司', 0),
    ('201004003', '技术部', '201004', '武汉分公司', 0);

